app/views/words/_form.html.erb

SELECT "languages".* FROM "languages" ORDER BY "languages"."name" ASC
---
    <%= f.label :language_id %>
    <%= f.collection_select :language_id, Language.order(:name),:id,:name %>

SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC
---
    <%= f.label :category_id %>
    <%= f.collection_select :category_id, Category.order(:id),:id,:category %>

SELECT "vnas".* FROM "vnas" ORDER BY "vnas"."id" ASC
---
    <%= f.label :vna_id %>
    <%= f.collection_select :vna_id, Vna.order(:id),:id,:name %>