app/views/words/index.html.erb

SELECT "languages".* FROM "languages"
---

      <%= select_tag(:language_id, options_from_collection_for_select(Language.all, :id, :name)) %>

SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <th>Category</th>
          <th><%= @words.first.language.name %></th>

SELECT  "words".* FROM "words" ORDER BY "words"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      Last Search words:<br>
      <% session[:word].each do |a| %>