app/views/words/popularpdf.pdf.erb

	</thead>
  <% @sorted = Word.all.order(:range).reverse %>
---
SELECT "words".* FROM "words" ORDER BY "words"."range" ASC