app/views/words/popular.html.erb

  </div>
  <% @sorted = Word.all.order(:range).reverse %>
---
SELECT "words".* FROM "words" ORDER BY "words"."range" ASC