app/controllers/makals_controller.rb

INSERT INTO "makals" ("kg", "tr", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @makal = Makal.new(makal_params)

    respond_to do |format|
      if @makal.save

SELECT  "makals".* FROM "makals" WHERE "makals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_makal
      @makal = Makal.find(params[:id])