app/controllers/words_controller.rb

  def index
    keyword = params[:search]
    keyword = '*' if keyword==nil || keyword==''

    @words=Word.search keyword, fields: [:word] , page: params[:page], per_page: 10
#
#Session save every search
    if session[:word]==nil
      session[:word]=[]
    end
    if keyword!='*'
      if session[:word].include? keyword

        else
          session[:word].push(keyword)
---
SELECT  "words".* FROM "words" ORDER BY "words"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "words" SET "range" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["range", 1], ["updated_at", "2018-04-22 16:11:21.051407"], ["id", 10]]

  def create
    @word = Word.new(word_params)

    respond_to do |format|
      if @word.save
---
INSERT INTO "words" ("language_id", "vna_id", "word", "translation", "definition", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_word
      @word = Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]